{
    "certificates": "My Certificates",

    "contact": {
        "title": "Contact",
        "form": {
            "subtitle": "Send me an e-mail",
            "inputName": "Name",
            "inputLastname": "Lastname",
            "inputEmail": "Email",
            "inputMessage": "Write your message here...",
            "error": "You must complete all fields",
            "submit": "Send"
        }
    },

    "Navbar": {
        "links": ["About me", "Skills", "Projects", "Certificates", "Contact"]
    },

    "Presentation": {
        "ImLeila": ["I", "'", "m"],
        "description": "Hi! 😄 My name is Leila and I am 23 years old, I have experience in Full Stack projects and Testing QA. I have knowledge in agile methodologies and collaborative tools such as Trello and Jira. 🚀 I am currently expanding my Java and Spring Boot skills I really want to continue learning. I am a perfectionist in everything I do and I always strive to offer solutions. If you want to know more about me, do not hesitate to contact me!"
    },

    "Proyectos": {

        "NatureXtreme": "E-Commerce of clothing for outdoor activities. It has a user profile to view products, add them to favorites and make purchases and an administrator profile to control product stock, modify and create new items and see registered users in the page. It also has a blog with information on sites where you can do this type of activity. In this group project we use technologies such as Chacra UI, Typescript, Express, TypeORM, among others.",

        "HenryVideogames": "Single Page created using React, Redux, Node Js, Express, Sequelize, PostgreSQL, among other tools. In this project you can see more than 100 games on different pages, search for games by name, see their description, filter them by location, sort them in Ascending, Descending or Rating order. You can also create games, update them, delete them and/or save them to your favourites.",
        
        "RickAndMorty": "Rick and Morty themed Single Page. It allows you to search for characters randomly, by id, add them to favorites, apply filters, sorts and delete searched characters. The Technologies that were used to create this page were React, Redux, Html, Css, Node Js, Express, Sequelize and PostgreSQL.",

        "verPagina": "See the project"
    },

    "Habilidades": "https://leila-salguero.vercel.app/static/media/Skills.4314ac89f2acdcede38a.mp4"
}