{
    "certificates": "Mis Certificados",
    
    "contact": {
        "title": "Contactame",
        "form": {
            "subtitle": "Enviame un email",
            "inputName": "Nombre",
            "inputLastname": "Apellido",
            "inputEmail": "Email",
            "inputMessage": "Escribe tu mensaje aqu칤 ...",
            "error": "Debe completar todos los campos",
            "submit": "Enviar"
        }
    },

    "Navbar": {
        "links": ["Sobre mi", "Habilidades", "Proyectos", "Certificados", "Contacto"]
    },

    "Presentation": {
        "ImLeila": ["S", "o", "y"],
        "descripcion": "Hola! 游땏 Mi nombre es Leila y tengo 23 a침os, tengo experiencia en proyectos Full Stack y de Testing QA Manual. Tengo conocimientos en metodolog칤as 치giles y herramientas colaborativas tales como Trello y Jira. 游 Actualmente estoy ampliando mis habilidades en Java y Spring Boot con muchas ganas de segu칤r aprendiendo. Soy muy perfeccionista en todo lo que hago y siempre me esfuerzo por ofrecer soluciones. Si quieres saber m치s de mi, no dudes en contactarme!"
    },

    "Proyectos": {

        "NatureXtreme": "E-Commerce de ropa para actividades al aire Libre.Cuenta con un perfil de usuario para ver productos, agregarlos a favoritos y realizar compras y un perfil de administrador para controlar stock de productos, modificar y crear nuevos articulos y ver los usuarios registrados en la p치gina. Adem치s cuenta con un blog con informaci칩n sobre sitios en los cuales podes realizar este tipo de actividades. En este proyecto grupal utilizamos tecnolog칤as tales como Chacra UI, Typescript, Express, TypeORM, entre otras.",

        "HenryVideogames": "Single Page creada utilizando React, Redux, Node Js, Express, Sequelize, PostgreSQL, entre otras herramientas. En este proyecto puedes ver m치s de 100 juegos en diferentes p치ginas, buscar juegos por nombre, ver su descripci칩n, filtrarlos por ubicaci칩n, ordenarlos en orden Ascendente, Descendente o por su Rating. Tambi칠n puedes crear juegos, actualizarlos, eliminarlos y/o guardarlos en tus favoritos.",
        
        "RickAndMorty": "Single Page con tem치tica de Rick and Morty. Permite buscar personajes al azar, por id, agregarlos a favoritos, aplicar filtros, ordenamientos y eliminar personajes buscados. Las T칠cnologias que se utilizaron para crear esta p치gina fueron React, Redux, Html, Css, Node Js, Express, Sequelize y PostgreSQL.",

        "verPagina": "Ver el proyecto"
    },

    "Habilidades": "https://leila-salguero.vercel.app/static/media/Skills.4314ac89f2acdcede38a.mp4"
}